# To install everything:
#
#     brew bundle install --global

# Basic dev tools
brew "git"
brew "git-lfs"
brew "neovim"
brew "tmux"
cask "docker"
cask "emacs"

# Command Line Utilities
brew "bat"
brew "cloc"
brew "colordiff"
brew "entr"
brew "fd"
brew "fzf"
brew "htop"
brew "ipython"
brew "jq"
brew "mosh"
brew "pandoc"
brew "the_silver_searcher"
brew "tree"
brew "watch"

# Misc
brew "reattach-to-user-namespace"

# Languages
brew "go"
brew "ghc"
brew "elixir"
brew "erlang"

# Web Stuff
brew "nginx"
brew "pgcli"
brew "redis", restart_service: true
brew "sqlite"
brew "telnet"
